# StairNotEnoughBoundaryCurves Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..StairNotEnoughBoundaryCurves Property
BuiltInFailures..::..SketchFailures Class See Also
---
Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairNotEnoughBoundaryCurves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairNotEnoughBoundaryCurves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairNotEnoughBoundaryCurves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace